<template>
  <div class="service"  :class="showService ? 'content-visible' : ''">
    <div class="mask" :class="showService ? 'visible' : 'visible-none'" @click="close" @touchmove.prevent></div>
    <div class="service-content" :class="showService ? 'content-visible' : ''">
      <div class="content">
        <span class="title">卡车之家大车市用户服务协议</span>
        <span class="details" v-html="content"></span>
      </div>
      <div class="close" @click="close">关闭</div>
    </div>
  </div>
</template>
<script>
export default {
  props: ['showService'],
  data: () => ({
    content: `<p class="service-title">提示条款</p></br>欢迎您与各我方平台经营者（详见定义条款）共同签署本《用户服务协议》（下称“本协议”）并使用我方平台服务！</br>各条款标题仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为维护您自身权益，建议您仔细阅读各条款具体表述。</br>【审慎阅读】在您支付订金之前，应当认真阅读本协议，如果您使用大车市平台买车，或以任何行为实际使用、享受大车市的服务，即表示您接受了本协议，并同意受本协议各项条款的约束！如您对协议有任何疑问，可向我方平台客服咨询。</br></br><p class="service-title">一、	定义</p></br>【我方】：我方平台经营者的单称，即北京卡车之家信息技术股份有限公司;</br>我方平台服务：我方基于互联网，以我方大车市平台网站内容分发、信息网络传播、互联网电视业务等方式在内的各种形态向您提供的各项服务。</br>【我方平台规则】：包括在所有我方平台网站内已经发布及后续发布的全部规则、用户服务协议、解读、公告等内容以及各平台在频道、活动页面、帮助中心等发布的各类规则、实施细则、产品说明、公告等。</br>【同一用户】：使用同一身份认证信息或经我方平台排查认定多个用户账户的实际控制人为同一人的，均视为同一用户。</br></br><p class="service-title">二、	协议范围</p></br>2.1 签约主体</br>【平等主体】本协议由您与我方平台经营者共同缔结，本协议对您与我方平台经营者均具有合同效力。</br>【主体信息】我方平台经营者是指经营我方平台的各法律主体，您可根据以上定义条款确定与您履约的我方主体。本协议项下，我方平台经营者可能根据我方平台的业务调整而发生变更，变更后的我方平台经营者与您共同履行本协议并向您提供服务，我方平台经营者的变更不会影响您本协议项下的权益。我方平台经营者还有可能因为提供新的我方平台服务而新增，如您使用新增的我方平台服务的，视为您同意新增的我方平台经营者与您共同履行本协议。发生争议时，您可根据您具体使用的服务及对您权益产生影响的具体行为对象确定与您履约的主体及争议相对方。</br>2.2 补充协议</br>由于互联网行业高速发展，您与我方签署的本协议列明的条款并不能完整罗列并覆盖您与我方所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此，我方平台《法律声明及隐私权政策》、我方平台规则均为本协议的补充协议，与本协议不可分割且具有同等法律效力。  如您使用我方平台服务，视为您同意上述补充协议。</br>2.3用户协议变更</br>我方平台可在我方平台更新用户协议、隐私政策及相关平台规则（统称“用户协议”，届时协议更新会通过系统提示、信息推送和/或您在我方平台留下的联系方式通知和提醒您注意。 用户协议变更后，如您继续使用我方平台服务，即意味着您同意接受我方更新后的用户协议。如您不同意变更后的用户协议，请您停止使用我方平台产品和服务。</br></br><p class="service-title">三、	用户账号规则</p></br>3.1用户保证向大车市提供的任何资料、注册信息的真实性、正确性及完整性，包括但不限于邮箱、联系电话等。用户保证大车市可以通过上述联系方式与用户进行有效联系；当上述资料发生变更时，及时更新用户资料，符合及时、详尽、准确的要求。否则，造成的一切后果由用户自行承担。</br>3.2在成功注册后，大车市会为每位用户开通一个账户作为其使用大车市服务的唯一身份标识，用户需自行妥善保管该账户的用户名和密码，该账户下所有操作均视为用户本人行为，因用户保管不善导致账号密码遗失泄露的，造成用户损失的，大车市不承担任何责任。</br>3.3用户转让或授权他人使用自己的大车市账户造成用户损失的，大车市不承担任何责任。</br>3.4每位用户至多只能拥有一个大车市账户。如有证据证明或大车市有理由相信用户存在注册多个大车市账户的情形，大车市有权不经过用户允许，采取取消订单、冻结或关闭账户、拒绝提供服务等措施，给大车市及相关方造成损失的，用户应承担赔偿责任。</br>3.5大车市用户必须是具有完全民事行为能力的自然人，或者是具有合法经营资格的实体组织。无民事行为能力、限制民事行为能力人以及无经营或特定经营资格的组织不得注册为大车市用户或超过其民事权利或行为能力范围在大车市进行交易，如否，大车市有权不经过用户允许，采取取消订单、冻结或关闭账户、拒绝提供服务等措施，给大车市及相关方造成损失的，用户应承担赔偿责任。</br></br><p class="service-title">四、	平台交易规则</p></br>4.1订金选车</br>1）提交订单</br>a.真实车源，经销商在线上报价，网友可以通过大车市线上选择某台车辆进行订金支付，并联系提供该车辆的经销商进行沟通或到店。用户可以对大车市提供的车型下单，下单后用户可根据实际情况发起退款或是确认提车操作。</br>b．提交订单时，需要用户填写真实有效的联系方式，以便订单可正常执行；若由于用户填写有误导致订单无法正常执行，大车市不承担任何责任。</br>2）支付订金</br>支付订金后用户会接收到购车、经销商信息的相关短信，并且在大车市“个人中心”内可查到支付了订金的订单详情，用户经过线下与经销商沟通、到店等方式最终确认是否提车或交易终止申请退款。</br>3）看车付款</br>a. 通过用户线下针对目标车辆的选购行为及过程，若与经销商达成一致，需要线下与经销商进行车辆尾款结算，和其他手续合约签订。完成后，用户需要在订单处进行提车确认。</br>b. 用户执行“确认提车”操作后，订金会在约定时间内结算给经销商，用户不可再发起退款。</br>c.用户执行“确认提车”操作前，可随时发起退款操作。</br>4）订金退还规则</br>a.通过大车市平台提供的支付方式支付的订金，并且在第三方支付平台原路退款有效期内申请退款的用户，可通过原账户退还给用户。</br>b. 通过大车市平台提供的支付方式支付的订金，但申请退款时已超过第三方支付平台原路退款有效期，则需要与大车市协商退款途径。</br>c．若产生退款纠纷，用户退款记录以大车市平台记录的数据为准；若大车市平台没有记录，以第三方支付平台记录的数据为准。</br>d．若用户已执行“确认提车”操作，默认认为用户已完成购车订单流程，订金想在约定时间结算给经销商；</br>e. 若用户已执行“确认提车”操作，默认认为用户已完成购车订单流程，订金无法进行退款操作；</br>4.2参与活动</br>大车市中如未注明大车市发起的活动，均为经销商主动发起、负责的活动，活动过程中产生的任何行为，大车市不承担任何责任。</br>1）活动报名</br>a.付费报名活动，经销商线上发布付费营销活动，用户选择适合自己的目标活动后，需要支付订金报名参加；提交信息时，需要用户填写真实有效的联系方式，以便订单可正常执行；若由于用户填写有误导致订单无法正常执行，大车市不承担任何责任。</br>b.免费报名活动，经销商线上发布免费报名营销活动，用户选择适合自己的目标活动后，需要提交个人信息报名参加；提交信息时，需要用户填写真实有效的联系方式，以便订单可正常执行；若由于用户填写有误导致订单无法正常执行，大车市不承担任何责任。</br>2）活动参与意向</br>用户提交参与活动意向申请后，经销商会有专人与用户联系，并与用户沟通购车或参与活动需求；若用户恶意扰乱大车市正常运营，大车市可选择不再对该用户提供任何服务。</br>3）到店核销</br>a.付费、免费报名参加活动的用户，到经销商处后，需要出示报名信息详情，并与经销商工作人员进行信息核实。</br>b.参与活动成功后，需要向经销商提供券码或其他系统提供的证明，经销商工作人员进行核销处理，证明您已使用了该权益。</br>4）活动注意事项</br>a. 每场参与活动的成交用户，请确保年满18周岁，具有完全的民事权利能力和行为能力。</br>b. 活动内容及规则由活动发起方提供，大车市不承担任何责任。</br>c.任何通过不正当手段参加活动者或扰乱现场秩序者，大车市有权在不事先通知的前提下取消其参加活动、享受团购优惠或获取奖品的资格。</br>d. 活动期间，因非大车市所能控制原因（包括但不限于参与用户操作不当、参与用户所在区域网络故障、支付平台网络不畅等）导致用户无法参与活动或者参与失败，大车市将不承担任何责任。</br>e. 如遇不可抗力因素，在法律允许的范围内，大车市将有权暂停、修改、终止直至取消全部活动及/或单场活动，为此大车市及经销商不承担任何赔偿责任或进行任何形式的补偿；</br>f. 大车市作为技术服务平台，不对各厂商及/或经销商销售的产品品质提供任何担保，请您保持谨慎进行购买；您与各厂商及/或经销商因购车而产生的任何纠纷（包括但不限于购车价格、优惠政策、车辆质量、异地购车、车辆置换、售后服务等），应由您与各厂商及/或经销商按照法律法规相关规定或双方签署的购车合同约定自行解决并由各厂商及/或经销商承担全部责任；</br>g. 本活动/礼品均由第三方服务商提供，大车市对第三方提供的礼品及/或服务不提供任何形式的担保，如遇产品质量、性能，服务等问题，请联系相关服务商解决问题，为此大车市及经销商不承担任何赔偿责任或进行任何形式的补偿；</br>h. 任何人或任何网站擅自以大车市名义从事此类似活动或恶意通知用户领奖，造成用户损失的，与大车市无关。</br>i. 请您按照买车顾问的提示，按时到店看车，错过将不能参加本次活动；</br>j. 请您在买车顾问的陪同下询价或订车，如私自与参与活动的经销商（以下简称经销商）询价或订车，则不能享受大车市购车服务。</br>k. 请您按照中国法律法规等相关规定及大车市、经销商的活动要求，完成购车，因此产生的任何税费将由您自行承担。</br></br><p class="service-title">五、	隐私政策</p></br>5.1未满18岁或其他不完全民事行为能力人的用户使用本服务必须取得监护人的同意。</br>5.2用户必须遵守大车市的使用条款及隐私政策。</br>5.3大车市对用户的电子邮件、手机号、银行账户等隐私资料进行保护，承诺不会在未获得用户许可的情况下擅自将用户的个人资料信息出租或出售给任何第三方，但以下情况除外：</br>① 用户同意让第三方共享资料；</br>② 用户同意公开其个人资料，享受为其提供的产品和服务；</br>③ 根据法律法规等有关规定，或者应行政、司法机构、专业事务机构、纠纷相对方的要求，向第三方或者行政、司法机构等披露；</br>④ 用户对底价满意选择商家时，即同意将联系方式提供给指定的商家;</br>⑤ 除上述情况外，大车市为了更好的为用户提供服务的，用户同意大车市使用个人信息资料或透露给第三方使用。</br></br><p class="service-title">六、用户行为规范</p></br>6.1用户有权根据本协议的约定，以及大车市上发布的相关规则在大车市平台上查询车型信息、提交购车订单、支付购车订金、点评商家服务、分享买车信息、参加大车市的有关活动，以及使用大车市提供的其他服务。</br>6.2用户在使用大车市过程中实施的所有行为均应遵守中华人民共和国法律、法规等规范性文件及大车市各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。如果违反上述承诺，产生任何法律后果的，用户应以自己的名义独立承担所有的法律责任，并确保大车市免于因此遭受任何损失。</br>6.3用户不得在大车市发表包含以下内容的言论：</br>① 反对宪法所确定的基本原则，煽动、抗拒、破坏宪法和法律、行政法规实施的；</br>② 煽动颠覆国家政权，推翻社会主义制度，煽动、分裂国家，破坏国家统一的；</br>③ 损害国家荣誉和利益的；</br>④ 煽动民族仇恨、民族歧视，破坏民族团结的；</br>⑤ 任何包含对种族、性别、宗教、地域内容等歧视的；</br>⑥ 捏造或者歪曲事实，散布谣言，扰乱社会秩序的；</br>⑦ 宣扬封建迷信、邪教、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；</br>⑧ 公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；</br>⑨ 损害国家机关信誉的；</br>⑩ 其他违反宪法和法律行政法规的。</br>6.4用户在分享购车体验、评价商家服务时，除遵守本条款外，还应遵守大车市的其他相关规定。</br>6.5对于被大车市暂时停止或者永久停止账号的用户，停止账号期间大车市将不在该用户账号下提供任何服务。</br>6.6对于任何影响或可能影响用户权利的情况，用户有权向大车市进行反馈，并提供相应证据资料，需要大车市协助解决的，应提供有足够证明力的证据资料。</br></br><p class="service-title">七、不可抗力及其它免责事由</p></br>7.1对于因大车市合理控制范围以外的原因，包括但不限于自然灾害、罢工、骚乱、物质短缺或定量配给、暴动、战争行为、政府行为、通讯或其他设施故障或严重伤亡事故等不可抗力因素，致使大车市对用户的返现延迟或未能履约的，大车市不承担任何责任；</br>7.2用户已足够了解本活动中收集用户信息的相关规则、使用目的、必要性等，大车市对此已尽到足够的告知、提示。</br>7.3大车市对链接到其他网站的隐私声明或其他内容不承担任何责任。</br>7.4大车市中包含的由第三方提供的服务，大车市只是为了用户的便利而提供该功能模块。您如需使用此等服务，应另行与第三方服务提供方达成服务协议，支付相应费用并承担可能的风险。大车市对第三方提供的服务不提供任何形式的保证，用户与第三方任何纠纷与大车市无关。</br>7.5大车市作为技术服务平台，提醒用户谨慎识别可能存在的虚假宣传、欺诈等不良行为，一经发现，请停止交易，否则，因此造成用户与经销商发生的任何诉讼或纠纷，大车市不承担任何责任。</br></br><p class="service-title">八、用户违约及处理</p></br>8.1 违约认定</br>发生如下情形之一的，视为您违约：</br>（一）使用我方平台服务时违反有关法律法规规定的；</br>（二）违反本协议或本协议补充协议（即本协议第2.2条）约定的。</br>为适应互联网行业发展和满足海量用户对高效优质服务的需求，您理解并同意，我方可在我方平台规则中约定违约认定的程序和标准。如：我方可依据您的用户数据与海量用户数据的关系来认定您是否构成违约；您有义务对您的数据异常现象进行充分举证和合理解释，否则将被认定为违约。</br>8.2 违约处理措施</br>【信息处理】您在我方平台上发布的内容和信息构成违约的，我方可根据相应规则立即对相应内容和信息进行删除、屏蔽等处理或对您的账户进行暂停使用、查封、注销等处理。</br>【行为限制】您在我方平台上实施的行为，或虽未在我方平台上实施但对我方平台及其用户产生影响的行为构成违约的，我方可依据相应规则对您的账户执行限制参加活动、中止向您提供部分或全部服务等处理措施。如您的行为构成根本违约的，我方可查封您的账户，终止向您提供服务。</br>【违规违法信息和行为报告主管部门】如果您在我方平台上的行为违反相关的法律法规，我方可依法向相关主管机关报告并提交您的使用记录和其他信息。</br>8.3 赔偿责任</br>如您的行为使我方及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿我方及/或其关联公司的上述全部损失。</br>如您的行为使我方及/或其关联公司遭受第三人主张权利，我方及/或其关联公司可在对第三人承担金钱给付等义务后就全部损失向您追偿。</br></br><p class="service-title">九、协议变更</p></br>9.1我方可根据国家法律法规变化及我方平台服务变化的需要，不时修改本协议、补充协议，变更后的协议、补充协议（下称“变更事项”）将通过本协议第10条约定的方式通知您。</br>9.2如您对变更事项不同意的，您应当于变更事项确定的生效之日起停止使用我方平台服务；如您在变更事项生效后仍继续使用我方平台服务，则视为您同意已生效的变更事项。</br></br><p class="service-title">十、通知</p></br>10.1 有效联系方式</br>您同意我方以以下合理的方式向您送达各类通知：</br>（一）公示的文案；</br>（二）站内消息、弹出消息、客户端推送的消息；</br>（三）根据您预留于我方平台的联系方式发出的电子邮件、手机短信、函件等。</br>您在注册成为我方平台用户，并接受我方平台服务时，您应该向我方提供真实有效的联系方式（包括您的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被联系的状态。</br>您在注册我方平台用户时生成的用于登陆我方平台接收站内信、系统消息的会员账号（包括子账号），也作为您的有效联系方式。</br>我方将向您的上述联系方式的其中之一或其中若干向您送达各类通知，而此类通知的内容可能对您的权利义务产生重大的有利或不利影响，请您务必及时关注。</br>您有权通过您注册时填写的手机号码或者电子邮箱获取您感兴趣的商品广告信息、促销优惠等商业性信息；您如果不愿意接收此类信息，您有权通过我方提供的相应的退订功能进行退订。</br>10.2 通知的送达</br>我方通过上述联系方式向您发出通知，其中以电子的方式发出的书面通知，包括但不限于在我方平台公告，向您提供的联系电话发送手机短信，向您提供的电子邮件地址发送电子邮件，向您的账号发送站内信息、系统消息，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。</br>对于在我方平台上因交易活动引起的任何纠纷，您同意我方平台、司法机关（包括但不限于人民法院）可以通过手机短信、电子邮件等现代通讯方式或邮寄方式向您送达投诉文件、法律文书（包括但不限于诉讼文书）。您指定接收法律文书的手机号码、电子邮箱账号等联系方式为您在我方平台注册、更新时提供的手机号码、电子邮箱联系方式，我方平台司法机关向上述联系方式发出投诉文件、法律文书即视为送达。您指定的邮寄地址为您的法定联系地址或您提供的有效联系地址。</br>您同意司法机关可采取以上一种或多种送达方式向您达法律文书，司法机关采取多种方式向您送达法律文书，送达时间以上述送达方式中最先送达的为准。</br>你应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由您自行承担由此可能产生的法律后果。</br></br><p class="service-title">十一、协议的终止</p></br>11.1 终止的情形</br>【用户发起的终止】您有权通过以下任一方式终止本协议：</br>（一）在满足我方平台网站公示的账户注销等清理条件时您通过网站注销您的账户的；</br>（二）变更事项生效前您停止使用并明示不愿接受变更事项的；</br>（三）您明示不愿继续使用我方平台服务，且符合我方平台终止条件的。</br>【平台发起的终止】出现以下情况时，我方可以本协议第10条的所列的方式通知您终止本协议：</br>（一）您违反本协议约定，我方依据违约条款终止本协议的；</br>（二）您转让本人账户、盗用他人账户、发布违禁内容和信息、骗取他人财物、采取不正当手段谋利等行为，我方依据我方平台规则对您的账户予以查封的；</br>（三）除上述情形外，因您多次违反我方平台规则相关规定且情节严重，我方依据我方平台规则对您的账户予以查封的；</br>（四）您的账户被我方依据本协议进行注销等清理的；</br>（五）您在我方平台有侵犯他人合法权益或其他严重违法违约行为的；</br>（六）其它根据相关法律法规我方应当终止服务的情况。</br>11.2 协议终止后的处理</br>【用户信息披露】本协议终止后，除法律有明确规定外，我方无义务向您或您指定的第三方披露您账户中的任何信息。</br>【我方平台权利】本协议终止后，我方享有下列权利：</br>（一）停止收集和使用您的个人信息，但可继续保存您留存于我方平台的其他内容和信息；</br>（二）对于您过往的违约行为，我方仍可依据本协议向您追究违约责任。</br>【交易处理】本协议终止后，对于您在本协议存续期间产生的交易订单，我方平台可关闭该等交易订单，我方可自行决定退回费用或扣除相关费用作为违约金。</br></br><p class="service-title">十二、法律适用、管辖与其他</p></br>12.1【法律适用】本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国法律；如法律无相关规定的，参照商业惯例及/或行业惯例。</br>12.2【管辖】您因使用我方平台服务所产生及与我方平台服务有关的争议，由我方与您协商解决。协商不成时，任何一方均可向被告所在地人民法院提起诉讼。</br>12.3【条款有效性】本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。</br>`
  }),
  methods: {
    close() {
      this.$emit('close')
    }
  }
}
</script>
<style scoped>
  .service{
    position: fixed;
    top: 0;
    left: 0;
    right: 0;
    bottom: 0;
    transform: translate3d(0,100%,0);
    z-index: 9;
  }
  .mask{
    position: fixed;
    top: 0;
    left: 0;
    right: 0;
    bottom: 0;
    background: rgba(0,0,0,.5);
    z-index: 8;
  }
  .visible-none{
    display: none;
  }
  .visible{
    animation: .6s opacitys 0s
  }
  @keyframes opacitys {
    0% {opacity: 0}
    100% {opacity: 1}
  }

  .service-content{
    position: absolute;
    left: 0;
    bottom: 0;
    right: 0;
    opacity: 0;
    display: flex;
    flex-direction: column;
    background: #EDEDED;
    z-index: 9;
    transform: translate3d(0,100%,0);
    transition: all .6s ease;
  }
  .content-visible{
    opacity: 1;
    transform: translate3d(0,0,0)
  }
  .content{
    flex: 1;
    height: 720px;
    background: #fff;
    display: flex;
    flex-direction: column;
  }
  .title{
    height: 76px;
    line-height: 76px;
    text-align: center;
    border-bottom: 2px solid #EDEDED;
    font-size: 32px;
    color: #333;
  }
  .details{
    padding: 24px 32px;
    flex: 1;
    font-size: 28px;
    color: #5C6066;
    line-height: 40px;
    overflow-y: auto;
    -webkit-overflow-scrolling: touch;
  }
  .close{
    margin-top: 8px;
    height: 96px;
    line-height: 96px;
    text-align: center;
    background: #fff;
    font-size: 32px;
    color: #17181A;
  }
</style>
